Autodesk.Revit.DB.OrdinateTextOrientation.ParallelToWitnessLine
the dimension text orientation parallel to witness line

Autodesk.Revit.DB.OrdinateTextOrientation.ParallelToDimensionLine
the dimension text orientation parallel to dimension line